Revit 2024 API
TableCellStyleOverrideOptions.VerticalAlignment Property
 Indicates if the vertical alignment characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool VerticalAlignment { get; set; }
Visual Basic
Public Property VerticalAlignment As Boolean
	Get
	Set
Visual C++
public:
property bool VerticalAlignment {
	bool get ();
	void set (bool value);
}
See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace